# 3. Напишите функцию, которая принимает количество повторных запусков теста и значение таймаута.
# Количество повторных запусков должно находиться в диапазоне от 0 до 5,
# а таймаут должен быть положительным числом. Если переданные значения не соответствуют этим требованиям,
# самостоятельно создайте исключение ValueError с помощью raise и добавьте понятное описание причины ошибки.
# Вызов функции необходимо поместить в try/except и корректно обработать созданные исключения.
# Проверьте работу программы минимум на трёх наборах данных: корректные значения,
# отрицательный таймаут и слишком большое количество повторных запусков


def a (retest,timeout):
    if retest > 5:
        raise ValueError(
            "Количество повторных запусков должно находиться в диапазоне от 0 до 5 !"
        )
    if timeout <= 0:
        raise ValueError(
            "Таймаут должен быть положительным числом !"
        )

    print(f"Количество повторных запусков: {retest}")
    print(f"Таймаут: {timeout} сек \n")

params = [
    (3, 10),
    (2, -1),
    (7, 6)
]

for i, j in params:
    try:
        a (i, j)
    except ValueError as e:
        print(f"Ошибка: {e} \n")
