# Дан файл целых чисел. Создать два новых файла,
# первый из которых содержит четные числа из исходного файла,
# а второй — нечетные (в том же порядке).
# Если четные или нечетные числа в исходном файле отсутствуют,
# то соответствующий результирующий файл оставить пустым.

with open("for_hw4.2.0.txt","r") as f_0:
    for i in f_0:
        i = int(i.strip())
        if i % 2 == 0:
            with open("for_hw4.2.1.txt","a") as f_1:
                f_1.write(str(i)+ "\n")
        else:
            with open("for_hw4.2.2.txt","a") as f_2:
                f_2.write(str(i)+ "\n")
