#1. Анализ чисел. Напишите программу, которая перебирает все числа от 1 до 30.
# Если число делится на 3, программа должна вывести вместо него Bug, если делится на 5 - Test,
# а если одновременно делится на 3 и на 5 - BugTest.
# Во всех остальных случаях необходимо вывести само число.

array = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30]
del_1 = 3
del_2 = 5
for number in array:
    if number % del_1 == 0:
        print(f"{number}  Bug")
    elif number % del_2 == 0:
        print(f"{number}  Test")
    else:
        print(f"{number}")
